Диплом21_августа_новый/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалоДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Диплом21_августа_новый/src/CommonModules/ВКМ_РаботаСФормами/Module.bsl
Процедура ДополнитьФорму(Форма) Экспорт
	
	// ++ Хоменко В.И. 12.08.26	
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ФормаЭлемента" Тогда
		ДобавитьПолеВСправочник(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьКомандуЗаполнить(Форма);		
	КонецЕсли;
	
	//-- Хоменко В.И. 12.08.26
	
КонецПроцедуры

Процедура ДобавитьПолеВСправочник(Форма)  
	
	// ++ Хоменко В.И. 12.08.26   
		
		Группа = Форма.Элементы.Добавить("ГруппаИнформацияОДоговорах", Тип("ГруппаФормы"), Форма);
		Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
		Группа.ОтображатьЗаголовок = ЛОЖЬ;
		Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;  
		
		Если Форма.Элементы.Найти("ВКМ_ДатаНачалоДоговора") = Неопределено Тогда
			ПолеВвода = Форма.Элементы.Добавить("ВКМ_ДатаНачалоДоговора", Тип("ПолеФормы"), Группа);
			ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
			ПолеВвода.Заголовок = "ДатаНачалоДоговора";
			ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаНачалоДоговора"; 
		КонецЕсли;
		
		Если форма.Элементы.Найти("ВКМ_ДатаОкончанияДоговора") = Неопределено Тогда
			ПолеВвода = Форма.Элементы.Добавить("ВКМ_ДатаОкончанияДоговора", Тип("ПолеФормы"), Группа);
			ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
			ПолеВвода.Заголовок = "ДатаОкончанияДоговора";
			ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДоговора"; 
		КонецЕсли;
		
		Если форма.Элементы.Найти("СуммаАбонентскойПлаты") = Неопределено Тогда
			ПолеВвода = Форма.Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты", Тип("ПолеФормы"), Группа);
			ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
			ПолеВвода.Заголовок = "СуммаАбонентскойПлаты";
			ПолеВвода.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
		КонецЕсли;
		
		Если форма.Элементы.Найти("ВКМ_СтоимостьЧасаРаботы") = Неопределено Тогда
			ПолеВвода = Форма.Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"), Группа);
			ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
			ПолеВвода.Заголовок = "СтоимостьЧасаРаботы";
			ПолеВвода.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы"; 
		КонецЕсли;  
    //-- Хоменко В.И. 12.08.26  
	
КонецПроцедуры 

Процедура ДобавитьКомандуЗаполнить(Форма) Экспорт
	
	// ++ Хоменко В.И. 21.08.26	
	
	Если Форма.Элементы.Найти("КнопкаКоманды") = Неопределено Тогда
		Команда = Форма.Команды.Добавить("Заполнить");
		Команда.Заголовок = "Заполнить";
		Команда.Действие = "ВКМ_Заполнить";
		
		КнопкаКоманды = Форма.Элементы.Добавить("Заполнить", Тип("КнопкаФормы"), Форма.ФормаДокумента);
		КнопкаКоманды.ИмяКоманды = "Заполнить";
		КнопкаКоманды.Заголовок = "Заполнить";
		КнопкаКоманды.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	КонецЕсли;

	//-- Хоменко В.И. 21.08.26
	
КонецПроцедуры
